name: "iris_xgboost"
platform: "onnxruntime_onnx"
max_batch_size: 0  # Disabled batching
input [
  {
    name: "sepal_length"
    data_type: TYPE_FP32
    dims: [1, 1]
  },
  {
    name: "sepal_width"
    data_type: TYPE_FP32
    dims: [1, 1]
  }
]
output [
  {
    name: "label"
    data_type: TYPE_INT64
    dims: [1]
  },
  {
    name: "probabilities"
    data_type: TYPE_FP32
    dims: [1, 3]
  }
]
instance_group [
  {
    count: 1
    kind: KIND_CPU
  }
]