name: "iris_xgboost"
platform: "onnxruntime_onnx"
max_batch_size: 0

input [
  {
    name: "input"
    data_type: TYPE_FP32
    dims: [ 2 ]
  }
]

output [
  {
    name: "label"
    data_type: TYPE_INT64
    dims: [2]
  },
  {
    name: "probabilities"
    data_type: TYPE_FP32
    dims: [2, 3]
  }
]

instance_group [
  {
    kind: KIND_CPU
  }
]